#!/bin/bash

#################################################################################
# Резервне копіювання БД АБС Б2 на мережевий ресурс Київського філіалу          #
# Автор:   Верхоламов Олег                                                      #
# Версія:  1.0                                                                  #
# Дата:    29.12.2017                                                           #
#################################################################################

# Прописуємо каталог де зберігаються БД
# DIRECTORY_DATABASES = /storage/backup/work
DIRECTORY_DATABASES = /storage/backup/work