#!/bin/bash

###############################################################################
#Генератор випадкових паролів                                                 #
# Автор: Верхоламов Олег                                                      #
###############################################################################

# Використоавується для генерації випадкових паролів з довжиною,
#+ яку задає користувач при запускі скрипту

# Задаємо константи
E_BADARGS=65

# Матриця символів з яких буде генеруватися пароль
MATRIX="0123456789ABCDEFGHIJKLMNOPQRSTUVWYZabcdefghijklmnopqrstuvwxyz"

# Довжина паролю за замовчуванням (мінімальна довжина паролю)
#+ якщо користувач не вводе довжину паролю при запуску скрипту
LENGTH="8"
num="$1"

# Об'являємо функцію генерації випадкового паролю
generate_password ()
{
# Переналаштовуємо начальне число генератора псевдовипадкових чисел
#+ (потрібно для більшої випадковості генеруємого паролю) 
SEED=$(head -1 /dev/urandom | od -N 1 | awk '{ print $2 }')
RANDOM=$SEED

if [ $num -le $LENGTH ]
then
	num=$LENGTH
fi

# Генеруємо пароль
while [ "${n:=1}" -le "${num:=$LENGTH}" ]
do
	PASS="$PASS${MATRIX:$(($RANDOM%${#MATRIX})):1}"
	let n+=1
done

# Виводимо пароль на екран
echo
echo "Згенерований пароль: $PASS"
echo
}

# Перевіряємо чи було введено довжину генеруємого паролю та чи довжина паролю менша 8 символів
if [ -z $1 ]
# Якщо не введено аргументів
then
	echo "Не було вказано довжини паролю. Пароль згенерується з мінімальною довжиною в 8 символів"
	echo "Для генерації паролю заданої довжини використовуйте скрипт з параметрами"
	echo "Наприклад: $0 10 - згенерує випадковий пароль довжиною 10 символів"
	generate_password
elif [ $num -gt $LENGTH ]
then
	generate_password
elif [ $num -le $LENGTH ]
then
	echo "Введена довжина паролю менша мінімальної"
	echo "Буде згенеровано пароль довжиною 8 символів"
	generate_password
fi

exit 0

