#!/bin/bash

#############################################################################
#Назначаємо змінні                                                          #
#############################################################################

# Вказуємо зовнішній ІР та назву інтерфейсу, який дивиться в зовнішній світ
INET_IP=46.164.134.26
INET_IFACE=enp6s0f1

# Вказуємо внутрішній ІР та назву інтерфейсу, який дивиться в локальну мережу
LAN_IP=173.1.9.9
LAN_IFACE=enp6s0f0

# Вказуємо назву інтерфейсу VPN  та мережу, яка належть йому
VPN_IFACE=tun0
VPN_RANGE=10.15.0.0/24

# Внутрішня мережа
LAN_RANGE=173.1.9.0/24

# Мережний інтерфейс петлі lo
LO_IFACE=lo
LO_IP=127.0.0.1

##############################################################################
# Прописуємо правила фаєрволу для VPN                                        #
##############################################################################

# Дозволяємо трафік між локальною мережею та мережею VPN
#+(потрібно для можливості доступу до серверу по внітрішному ІР з клієнта)
iptables -A FORWARD -p all -i $LAN_IFACE -o $VPN_IFACE -j ACCEPT
iptables -A FORWARD -p all -o $LAN_IFACE -i $VPN_IFACE -j ACCEPT

#Дозволяємо вхідний та вихідний трафік для VPN-інтерфейсу
#+(потрібно для можливості встановлення VPN-з'єднання)
iptables -A INPUT -p all -i $VPN_IFACE -j ACCEPT
iptables -A OUTPUT -p all -o $VPN_IFACE -j ACCEPT
