#!/bin/bash

######################################################################
# Скрипт з правилами для фаєрволу, який дозволяє трафік між          #
#+ інтерфейсами які дивляться на Києв та на Кременчук                #
######################################################################

# Задаємо змінні 
#+ Назви та адреси інтерфейсів, які дивляться на Києв та на Кременчук

# Вказуємо назву та ІР інтерфейсу, який дивиться на Києв
KIEV_IFACE=enp9s0f1
KIEV_IP=192.168.148.3

# Вказуємо назву та ІР інтерфейсу, який дивиться на Кременчук
KREM_IFACE=enp6s0f0
KREM_IP=173.1.9.9

######################################################################
# Прописуємо правила для фаєрволу                                    #
######################################################################

# Дозволяємо трафік між інтерфейсами
#+(потрібно для обміну пакетами між інтерфейсами)
iptables -A FORWARD -p all -i $KREM_IFACE -o $KIEV_IFACE -j ACCEPT
iptables -A FORWARD -p all -o $KREM_IFACE -i $KIEV_IFACE -j ACCEPT


