#!/bin/bash

#################################################################################
# Резервне копіювання БД АБС Б2 та iFOBS на мережевий ресурс Київського філіалу #
# Автор:   Верхоламов Олег                                                      #
# Версія:  1.0                                                                  #
# Дата:    29.12.2017                                                           #
#################################################################################

